[
    {
        "id": "2503.14462v1",
        "title": "Blockchain with proof of quantum work",
        "authors": [
            "Mohammad H. Amin",
            "Jack Raymond",
            "Daniel Kinn",
            "Firas Hamze",
            "Kelsey Hamer",
            "Joel Pasvolsky",
            "William Bernoudy",
            "Andrew D. King",
            "Samuel Kortas"
        ],
        "published": "2025-03-18T17:37:22Z",
        "summary": "We propose a blockchain architecture in which mining requires a quantum computer. The consensus mechanism is based on proof of quantum work, a quantum-enhanced alternative to traditional proof of work that leverages quantum supremacy to make mining intractable for classical computers. We have refined the blockchain framework to incorporate the probabilistic nature of quantum mechanics, ensuring stability against sampling errors and hardware inaccuracies. To validate our approach, we implemented a prototype blockchain on four D-Wave$^{\\rm TM}$ quantum annealing processors geographically distributed within North America, demonstrating stable operation across hundreds of thousands of quantum hashing operations. Our experimental protocol follows the same approach used in the recent demonstration of quantum supremacy [1], ensuring that classical computers cannot efficiently perform the same computation task. By replacing classical machines with quantum systems for mining, it is possible to significantly reduce the energy consumption and environmental impact traditionally associated with blockchain mining. Beyond serving as a proof of concept for a meaningful application of quantum computing, this work highlights the potential for other near-term quantum computing applications using existing technology.",
        "field_name": "Quantum Computing",
        "field_id": 1,
        "subfield_name": "Quantum Cryptography",
        "subfield_id": 1,
        "link": "http://arxiv.org/abs/2503.14462v1"
    },
    {
        "id": "2503.09375v1",
        "title": "Quantum Computing and Cybersecurity Education: A Novel Curriculum for Enhancing Graduate STEM Learning",
        "authors": [
            "Suryansh Upadhyay",
            "Koustubh Phalak",
            "Jungeun Lee",
            "Kathleen Mitchell Hill",
            "Swaroop Ghosh"
        ],
        "published": "2025-03-12T13:26:54Z",
        "summary": "Quantum computing is an emerging paradigm with the potential to transform numerous application areas by addressing problems considered intractable in the classical domain. However, its integration into cyberspace introduces significant security and privacy challenges. The exponential rise in cyber attacks, further complicated by quantum capabilities, poses serious risks to financial systems and national security. The scope of quantum threats extends beyond traditional software, operating system, and network vulnerabilities, necessitating a shift in cybersecurity education. Traditional cybersecurity education, often reliant on didactic methods, lacks hands on, student centered learning experiences necessary to prepare students for these evolving challenges. There is an urgent need for curricula that address both classical and quantum security threats through experiential learning. In this work, we present the design and evaluation of EE 597: Introduction to Hardware Security, a graduate level course integrating hands-on quantum security learning with classical security concepts through simulations and cloud-based quantum hardware. Unlike conventional courses focused on quantum threats to cryptographic systems, EE 597 explores security challenges specific to quantum computing itself. We employ a mixed-methods evaluation using pre and post surveys to assess student learning outcomes and engagement. Results indicate significant improvements in students' understanding of quantum and hardware security, with strong positive feedback on course structure and remote instruction (mean scores: 3.33 to 3.83 on a 4 point scale).",
        "field_name": "Quantum Computing",
        "field_id": 1,
        "subfield_name": "Quantum Machine Learning",
        "subfield_id": 2,
        "link": "http://arxiv.org/abs/2503.09375v1"
    },
    {
        "id": "2503.12952v1",
        "title": "Performance Analysis and Industry Deployment of Post-Quantum Cryptography Algorithms",
        "authors": [
            "Elif Dicle Demir",
            "Buse Bilgin",
            "Mehmet Cengiz Onbasli"
        ],
        "published": "2025-03-17T09:06:03Z",
        "summary": "As quantum computing advances, modern cryptographic standards face an existential threat, necessitating a transition to post-quantum cryptography (PQC). The National Institute of Standards and Technology (NIST) has selected CRYSTALS-Kyber and CRYSTALS-Dilithium as standardized PQC algorithms for secure key exchange and digital signatures, respectively. This study conducts a comprehensive performance analysis of these algorithms by benchmarking execution times across cryptographic operations such as key generation, encapsulation, decapsulation, signing, and verification. Additionally, the impact of AVX2 optimizations is evaluated to assess hardware acceleration benefits. Our findings demonstrate that Kyber and Dilithium achieve efficient execution times, outperforming classical cryptographic schemes such as RSA and ECDSA at equivalent security levels. Beyond technical performance, the real-world deployment of PQC introduces challenges in telecommunications networks, where large-scale infrastructure upgrades, interoperability with legacy systems, and regulatory constraints must be addressed. This paper examines the feasibility of PQC adoption in telecom environments, highlighting key transition challenges, security risks, and implementation strategies. Through industry case studies, we illustrate how telecom operators are integrating PQC into 5G authentication, subscriber identity protection, and secure communications. Our analysis provides insights into the computational trade-offs, deployment considerations, and standardization efforts shaping the future of quantum-safe cryptographic infrastructure.",
        "field_name": "Quantum Computing",
        "field_id": 1,
        "subfield_name": "Quantum Risk Analysis",
        "subfield_id": 3,
        "link": "http://arxiv.org/abs/2503.12952v1"
    },
    {
        "id": "2503.14462v1",
        "title": "Blockchain with proof of quantum work",
        "authors": [
            "Mohammad H. Amin",
            "Jack Raymond",
            "Daniel Kinn",
            "Firas Hamze",
            "Kelsey Hamer",
            "Joel Pasvolsky",
            "William Bernoudy",
            "Andrew D. King",
            "Samuel Kortas"
        ],
        "published": "2025-03-18T17:37:22Z",
        "summary": "We propose a blockchain architecture in which mining requires a quantum computer. The consensus mechanism is based on proof of quantum work, a quantum-enhanced alternative to traditional proof of work that leverages quantum supremacy to make mining intractable for classical computers. We have refined the blockchain framework to incorporate the probabilistic nature of quantum mechanics, ensuring stability against sampling errors and hardware inaccuracies. To validate our approach, we implemented a prototype blockchain on four D-Wave$^{\\rm TM}$ quantum annealing processors geographically distributed within North America, demonstrating stable operation across hundreds of thousands of quantum hashing operations. Our experimental protocol follows the same approach used in the recent demonstration of quantum supremacy [1], ensuring that classical computers cannot efficiently perform the same computation task. By replacing classical machines with quantum systems for mining, it is possible to significantly reduce the energy consumption and environmental impact traditionally associated with blockchain mining. Beyond serving as a proof of concept for a meaningful application of quantum computing, this work highlights the potential for other near-term quantum computing applications using existing technology.",
        "field_name": "Quantum Computing",
        "field_id": 1,
        "subfield_name": "Quantum Payment Systems",
        "subfield_id": 4,
        "link": "http://arxiv.org/abs/2503.14462v1"
    },
    {
        "id": "2503.14462v1",
        "title": "Blockchain with proof of quantum work",
        "authors": [
            "Mohammad H. Amin",
            "Jack Raymond",
            "Daniel Kinn",
            "Firas Hamze",
            "Kelsey Hamer",
            "Joel Pasvolsky",
            "William Bernoudy",
            "Andrew D. King",
            "Samuel Kortas"
        ],
        "published": "2025-03-18T17:37:22Z",
        "summary": "We propose a blockchain architecture in which mining requires a quantum computer. The consensus mechanism is based on proof of quantum work, a quantum-enhanced alternative to traditional proof of work that leverages quantum supremacy to make mining intractable for classical computers. We have refined the blockchain framework to incorporate the probabilistic nature of quantum mechanics, ensuring stability against sampling errors and hardware inaccuracies. To validate our approach, we implemented a prototype blockchain on four D-Wave$^{\\rm TM}$ quantum annealing processors geographically distributed within North America, demonstrating stable operation across hundreds of thousands of quantum hashing operations. Our experimental protocol follows the same approach used in the recent demonstration of quantum supremacy [1], ensuring that classical computers cannot efficiently perform the same computation task. By replacing classical machines with quantum systems for mining, it is possible to significantly reduce the energy consumption and environmental impact traditionally associated with blockchain mining. Beyond serving as a proof of concept for a meaningful application of quantum computing, this work highlights the potential for other near-term quantum computing applications using existing technology.",
        "field_name": "Quantum Computing",
        "field_id": 1,
        "subfield_name": "Quantum Blockchain",
        "subfield_id": 5,
        "link": "http://arxiv.org/abs/2503.14462v1"
    }
]