[
    {
        "id": "2503.12952v1",
        "title": "Performance Analysis and Industry Deployment of Post-Quantum Cryptography Algorithms",
        "authors": [
            "Elif Dicle Demir",
            "Buse Bilgin",
            "Mehmet Cengiz Onbasli"
        ],
        "published": "2025-03-17T09:06:03Z",
        "summary": "As quantum computing advances, modern cryptographic standards face an existential threat, necessitating a transition to post-quantum cryptography (PQC). The National Institute of Standards and Technology (NIST) has selected CRYSTALS-Kyber and CRYSTALS-Dilithium as standardized PQC algorithms for secure key exchange and digital signatures, respectively. This study conducts a comprehensive performance analysis of these algorithms by benchmarking execution times across cryptographic operations such as key generation, encapsulation, decapsulation, signing, and verification. Additionally, the impact of AVX2 optimizations is evaluated to assess hardware acceleration benefits. Our findings demonstrate that Kyber and Dilithium achieve efficient execution times, outperforming classical cryptographic schemes such as RSA and ECDSA at equivalent security levels. Beyond technical performance, the real-world deployment of PQC introduces challenges in telecommunications networks, where large-scale infrastructure upgrades, interoperability with legacy systems, and regulatory constraints must be addressed. This paper examines the feasibility of PQC adoption in telecom environments, highlighting key transition challenges, security risks, and implementation strategies. Through industry case studies, we illustrate how telecom operators are integrating PQC into 5G authentication, subscriber identity protection, and secure communications. Our analysis provides insights into the computational trade-offs, deployment considerations, and standardization efforts shaping the future of quantum-safe cryptographic infrastructure.",
        "field_name": "Quantum Computing",
        "field_id": 1,
        "subfield_name": "Quantum Cryptography",
        "subfield_id": 1,
        "link": "http://arxiv.org/abs/2503.12952v1"
    },
    {
        "id": "2503.09375v1",
        "title": "Quantum Computing and Cybersecurity Education: A Novel Curriculum for Enhancing Graduate STEM Learning",
        "authors": [
            "Suryansh Upadhyay",
            "Koustubh Phalak",
            "Jungeun Lee",
            "Kathleen Mitchell Hill",
            "Swaroop Ghosh"
        ],
        "published": "2025-03-12T13:26:54Z",
        "summary": "Quantum computing is an emerging paradigm with the potential to transform numerous application areas by addressing problems considered intractable in the classical domain. However, its integration into cyberspace introduces significant security and privacy challenges. The exponential rise in cyber attacks, further complicated by quantum capabilities, poses serious risks to financial systems and national security. The scope of quantum threats extends beyond traditional software, operating system, and network vulnerabilities, necessitating a shift in cybersecurity education. Traditional cybersecurity education, often reliant on didactic methods, lacks hands on, student centered learning experiences necessary to prepare students for these evolving challenges. There is an urgent need for curricula that address both classical and quantum security threats through experiential learning. In this work, we present the design and evaluation of EE 597: Introduction to Hardware Security, a graduate level course integrating hands-on quantum security learning with classical security concepts through simulations and cloud-based quantum hardware. Unlike conventional courses focused on quantum threats to cryptographic systems, EE 597 explores security challenges specific to quantum computing itself. We employ a mixed-methods evaluation using pre and post surveys to assess student learning outcomes and engagement. Results indicate significant improvements in students' understanding of quantum and hardware security, with strong positive feedback on course structure and remote instruction (mean scores: 3.33 to 3.83 on a 4 point scale).",
        "field_name": "Quantum Computing",
        "field_id": 1,
        "subfield_name": "Quantum Machine Learning",
        "subfield_id": 2,
        "link": "http://arxiv.org/abs/2503.09375v1"
    },
    {
        "id": "2503.12952v1",
        "title": "Performance Analysis and Industry Deployment of Post-Quantum Cryptography Algorithms",
        "authors": [
            "Elif Dicle Demir",
            "Buse Bilgin",
            "Mehmet Cengiz Onbasli"
        ],
        "published": "2025-03-17T09:06:03Z",
        "summary": "As quantum computing advances, modern cryptographic standards face an existential threat, necessitating a transition to post-quantum cryptography (PQC). The National Institute of Standards and Technology (NIST) has selected CRYSTALS-Kyber and CRYSTALS-Dilithium as standardized PQC algorithms for secure key exchange and digital signatures, respectively. This study conducts a comprehensive performance analysis of these algorithms by benchmarking execution times across cryptographic operations such as key generation, encapsulation, decapsulation, signing, and verification. Additionally, the impact of AVX2 optimizations is evaluated to assess hardware acceleration benefits. Our findings demonstrate that Kyber and Dilithium achieve efficient execution times, outperforming classical cryptographic schemes such as RSA and ECDSA at equivalent security levels. Beyond technical performance, the real-world deployment of PQC introduces challenges in telecommunications networks, where large-scale infrastructure upgrades, interoperability with legacy systems, and regulatory constraints must be addressed. This paper examines the feasibility of PQC adoption in telecom environments, highlighting key transition challenges, security risks, and implementation strategies. Through industry case studies, we illustrate how telecom operators are integrating PQC into 5G authentication, subscriber identity protection, and secure communications. Our analysis provides insights into the computational trade-offs, deployment considerations, and standardization efforts shaping the future of quantum-safe cryptographic infrastructure.",
        "field_name": "Quantum Computing",
        "field_id": 1,
        "subfield_name": "Quantum Risk Analysis",
        "subfield_id": 3,
        "link": "http://arxiv.org/abs/2503.12952v1"
    },
    {
        "id": "2503.12952v1",
        "title": "Performance Analysis and Industry Deployment of Post-Quantum Cryptography Algorithms",
        "authors": [
            "Elif Dicle Demir",
            "Buse Bilgin",
            "Mehmet Cengiz Onbasli"
        ],
        "published": "2025-03-17T09:06:03Z",
        "summary": "As quantum computing advances, modern cryptographic standards face an existential threat, necessitating a transition to post-quantum cryptography (PQC). The National Institute of Standards and Technology (NIST) has selected CRYSTALS-Kyber and CRYSTALS-Dilithium as standardized PQC algorithms for secure key exchange and digital signatures, respectively. This study conducts a comprehensive performance analysis of these algorithms by benchmarking execution times across cryptographic operations such as key generation, encapsulation, decapsulation, signing, and verification. Additionally, the impact of AVX2 optimizations is evaluated to assess hardware acceleration benefits. Our findings demonstrate that Kyber and Dilithium achieve efficient execution times, outperforming classical cryptographic schemes such as RSA and ECDSA at equivalent security levels. Beyond technical performance, the real-world deployment of PQC introduces challenges in telecommunications networks, where large-scale infrastructure upgrades, interoperability with legacy systems, and regulatory constraints must be addressed. This paper examines the feasibility of PQC adoption in telecom environments, highlighting key transition challenges, security risks, and implementation strategies. Through industry case studies, we illustrate how telecom operators are integrating PQC into 5G authentication, subscriber identity protection, and secure communications. Our analysis provides insights into the computational trade-offs, deployment considerations, and standardization efforts shaping the future of quantum-safe cryptographic infrastructure.",
        "field_name": "Quantum Computing",
        "field_id": 1,
        "subfield_name": "Quantum Payment Systems",
        "subfield_id": 4,
        "link": "http://arxiv.org/abs/2503.12952v1"
    },
    {
        "id": "2503.11913v1",
        "title": "Implementation of classical client universal blind quantum computation with 8-state RSP in current architecture",
        "authors": [
            "Aman Gupta",
            "Daniel Prasanth",
            "Venkat Chandra Gunja"
        ],
        "published": "2025-03-14T22:52:02Z",
        "summary": "The future of quantum computing architecture is most likely the one in which a large number of clients are either fully classical or have a very limited quantum capability while a very small number of servers having the capability to perform quantum computations and most quantum computational tasks are delegated to these quantum servers. In this architecture, it becomes very crucial that a classical/semi-classical client is able to keep the delegated data/ computation secure against eavesdroppers as well as the server itself, known as the blindness feature. In 2009, A. Broadbent et. al proposed a universal blind quantum computation (UBQC) protocol based on measurement-based quantum computation (MBQC) that enables a semi-classical client to delegate universal quantum computation to a quantum server, interactively and fetch the results while the computation itself remains blind to the server. In this work, we propose an implementation (with examples) of UBQC in the current quantum computing architecture, a fully classical client, a quantum server (IBM Quantum) and the computation does not proceed interactively (projective measurement basis is not decided by previous measurement outcome). We combined UBQC with the 8-state remote state preparation (RSP) protocol, to blindly prepare the initial cluster state, which is an initial resource state in UBQC protocol, to allow a completely classical client to perform delegated blind quantum computation. Such an implementation has already been shown to be secure in a game-based security setting, which is the weakest security model.",
        "field_name": "Quantum Computing",
        "field_id": 1,
        "subfield_name": "Quantum Financial Modeling",
        "subfield_id": 5,
        "link": "http://arxiv.org/abs/2503.11913v1"
    },
    {
        "id": "2502.15023v1",
        "title": "A Quantum Signature Validation Algorithm for Efficient Detection of Tampered Transactions in Blockchain",
        "authors": [
            "Jaime Torres",
            "Sergio A. Ortega",
            "Miguel A. Martin-Delgado"
        ],
        "published": "2025-02-20T20:20:22Z",
        "summary": "The Quantum Signature Validation Algorithm (QSVA) is introduced as a novel quantum-based approach designed to enhance the detection of tampered transactions in blockchain systems. Leveraging the powerful capabilities of quantum computing, especially within the framework of transaction-based blockchains, the QSVA aims to surpass classical methods in both speed and efficiency. By utilizing a quantum walk approach integrated with PageRank-based search algorithms, QSVA provides a robust mechanism for identifying fraudulent transactions. Our adaptation of the transaction graph representation efficiently verifies transactions by maintaining a current set of unspent transaction outputs (UTXOs) characteristic of models like Bitcoin. The QSVA not only amplifies detection efficacy through a quadratic speedup but also incorporates two competing quantum search algorithms$-$Quantum SearchRank and Randomized SearchRank$-$to explore their effectiveness as foundational components. Our results indicate that Randomized SearchRank, in particular, outperforms its counterpart in aligning with transaction rankings based on the Classical PageRank algorithm, ensuring more consistent detection probabilities. These findings highlight the potential for quantum algorithms to revolutionize blockchain security by improving detection times to $O(\\sqrt{N})$. Progress in Distributed Ledger Technologies (DLTs) could facilitate future integration of quantum solutions into more general distributed systems. As quantum technology continues to evolve, the QSVA stands as a promising strategy offering significant advancements in blockchain efficiency and security.",
        "field_name": "Quantum Computing",
        "field_id": 1,
        "subfield_name": "Quantum Blockchain",
        "subfield_id": 6,
        "link": "http://arxiv.org/abs/2502.15023v1"
    },
    {
        "id": "2410.10110v2",
        "title": "Mastering AI: Big Data, Deep Learning, and the Evolution of Large Language Models -- Blockchain and Applications",
        "authors": [
            "Pohsun Feng",
            "Ziqian Bi",
            "Lawrence K. Q. Yan",
            "Yizhu Wen",
            "Benji Peng",
            "Junyu Liu",
            "Caitlyn Heqi Yin",
            "Tianyang Wang",
            "Keyu Chen",
            "Sen Zhang",
            "Ming Li",
            "Jiawei Xu",
            "Ming Liu",
            "Xuanhe Pan",
            "Jinlang Wang",
            "Qian Niu"
        ],
        "published": "2024-10-14T02:56:36Z",
        "summary": "A detailed exploration of blockchain technology and its applications across various fields is provided, beginning with an introduction to cryptography fundamentals, including symmetric and asymmetric encryption, and their roles in ensuring security and trust within blockchain systems. The structure and mechanics of Bitcoin and Ethereum are then examined, covering topics such as proof-of-work, proof-of-stake, and smart contracts. Practical applications of blockchain in industries like decentralized finance (DeFi), supply chain management, and identity authentication are highlighted. The discussion also extends to consensus mechanisms and scalability challenges in blockchain, offering insights into emerging technologies like Layer 2 solutions and cross-chain interoperability. The current state of academic research on blockchain and its potential future developments are also addressed.",
        "field_name": "Decentralized Finance (DeFi)",
        "field_id": 2,
        "subfield_name": "Decentralized Identity",
        "subfield_id": 7,
        "link": "http://arxiv.org/abs/2410.10110v2"
    },
    {
        "id": "2501.07508v1",
        "title": "Improving DeFi Accessibility through Efficient Liquidity Provisioning with Deep Reinforcement Learning",
        "authors": [
            "Haonan Xu",
            "Alessio Brini"
        ],
        "published": "2025-01-13T17:27:11Z",
        "summary": "This paper applies deep reinforcement learning (DRL) to optimize liquidity provisioning in Uniswap v3, a decentralized finance (DeFi) protocol implementing an automated market maker (AMM) model with concentrated liquidity. We model the liquidity provision task as a Markov Decision Process (MDP) and train an active liquidity provider (LP) agent using the Proximal Policy Optimization (PPO) algorithm. The agent dynamically adjusts liquidity positions by using information about price dynamics to balance fee maximization and impermanent loss mitigation. We use a rolling window approach for training and testing, reflecting realistic market conditions and regime shifts. This study compares the data-driven performance of the DRL-based strategy against common heuristics adopted by small retail LP actors that do not systematically modify their liquidity positions. By promoting more efficient liquidity management, this work aims to make DeFi markets more accessible and inclusive for a broader range of participants. Through a data-driven approach to liquidity management, this work seeks to contribute to the ongoing development of more efficient and user-friendly DeFi markets.",
        "field_name": "Decentralized Finance (DeFi)",
        "field_id": 2,
        "subfield_name": "Automated Market Makers",
        "subfield_id": 8,
        "link": "http://arxiv.org/abs/2501.07508v1"
    },
    {
        "id": "2212.10308v1",
        "title": "DeFi Risk Transfer: Towards A Fully Decentralized Insurance Protocol",
        "authors": [
            "Matthias Nadler",
            "Felix Bekemeier",
            "Fabian Schär"
        ],
        "published": "2022-12-20T14:55:51Z",
        "summary": "In this paper, we propose a fully decentralized and smart contract-based insurance protocol. We identify various issues in the Decentralized Finance (DeFi) insurance context and propose a solution to overcome these shortcomings. We introduce an economic model that allows for risk transfer without any external dependencies or centralized intermediaries. In particular, our proposal does not need any sort of subjective claim assessment, community voting or external data providers (oracles). Moreover, it solves the problem of over-insurance and proposes various ways to mitigate the capital inefficiencies usually seen with DeFi collateral. The work takes inspiration from peer-to-peer (P2P) insurance and collateralized debt obligations (CDO). We formally describe the protocol, assess its efficiency and key properties and present a reference implementation. Finally, we address limitations, extensions and ideas for further research.",
        "field_name": "Decentralized Finance (DeFi)",
        "field_id": 2,
        "subfield_name": "Decentralized Insurance",
        "subfield_id": 9,
        "link": "http://arxiv.org/abs/2212.10308v1"
    },
    {
        "id": "2212.05734v1",
        "title": "Decentralized lending and its users: Insights from Compound",
        "authors": [
            "Kanis Saengchote"
        ],
        "published": "2022-12-12T07:15:15Z",
        "summary": "Permissionless blockchains offer an information environment where users can interact privately without fear of censorship. Financial services can be programmatically coded via smart contracts to automate transactions without the need for human intervention or knowing user identity. This new paradigm is known as decentralized finance (DeFi). We investigate Compound (a leading DeFi lending protocol) to show how it works in this novel information environment, who its users are, and what factors determine their participation. On-chain transaction data shows that loan durations are short (31 days on average), and many users borrow to support leveraged investment strategies (yield farming). We show that systemic risk in DeFi arises from concentration and interconnection, and how traditional risk management practices can be challenging for DeFi.",
        "field_name": "Decentralized Finance (DeFi)",
        "field_id": 2,
        "subfield_name": "Yield Farming",
        "subfield_id": 10,
        "link": "http://arxiv.org/abs/2212.05734v1"
    }
]